Revit 2016 API
IDuctPressureDropServer Interface
 Interface for external servers implementing duct pressure drop calculation.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public interface IDuctPressureDropServer : IExternalServer
Visual Basic
Public Interface IDuctPressureDropServer _
	Inherits IExternalServer
Visual C++
public interface class IDuctPressureDropServer : IExternalServer
See Also
IDuctPressureDropServer Members
Autodesk.Revit.DB.Mechanical Namespace